pisppus/PipKit/lib/PipKit/PipCore/Platforms/ESP32/Transports/St7789Spi.cpp
#include <PipCore/Config/Features.hpp>

#if PIPCORE_DISPLAY_ID(PIPCORE_DISPLAY) == PIPCORE_DISPLAY_TAG_ST7789

#include <PipCore/Platforms/ESP32/Transports/St7789Spi.hpp>

#if PIPCORE_TARGET_ESP32
#include <sdkconfig.h>
#include <esp_heap_caps.h>
#include <esp_attr.h>
#include <driver/spi_master.h>
#include <driver/gpio.h>
#include <hal/gpio_ll.h>
#include <esp_rom_gpio.h>
#include <esp_rom_sys.h>

#if __has_include(<esp_memory_utils.h>)
#include <esp_memory_utils.h>
#endif
#if __has_include(<soc/soc_memory_layout.h>)
#include <soc/soc_memory_layout.h>
#endif

#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#endif

#include <PipCore/Debug/MemoryHooks.hpp>

#include <cstring>
#include <algorithm>

namespace pipcore::esp32
{
    namespace
    {
        [[nodiscard]] inline constexpr bool isPinValid(int8_t pin) noexcept { return pin >= 0; }
        constexpr size_t DmaBufSize = 16384U;

#if PIPCORE_TARGET_ESP32
        static DMA_ATTR uint8_t g_dmaBuf[2][DmaBufSize];
#endif

        inline void IRAM_ATTR __attribute__((always_inline)) fastFill32(uint32_t *dest, size_t words, uint32_t value) noexcept
        {
            size_t blocks = words >> 3;
            while (blocks--)
            {
                dest[0] = value;
                dest[1] = value;
                dest[2] = value;
                dest[3] = value;
                dest[4] = value;
                dest[5] = value;
                dest[6] = value;
                dest[7] = value;
                dest += 8;
            }

            size_t remainder = words & 7U;
            while (remainder--)
            {
                *dest++ = value;
            }
        }

        [[nodiscard]] inline bool isDmaCapable(const void *p) noexcept
        {
#if PIPCORE_TARGET_ESP32
#if defined(CONFIG_IDF_TARGET_ESP32S3)
            return esp_ptr_internal(p) || esp_ptr_dma_ext_capable(p);
#else
            return esp_ptr_dma_capable(p);
#endif
#else
            (void)p;
            return false;
#endif
        }

        inline void IRAM_ATTR gpio_fast_write_high(int8_t pin) noexcept
        {
#if PIPCORE_TARGET_ESP32
            if (__builtin_expect(pin < 32, 1))
            {
                GPIO.out_w1ts = (1UL << pin);
            }
            else
            {
                gpio_ll_set_level(&GPIO, static_cast<gpio_num_t>(pin), 1);
            }
#else
            (void)pin;
#endif
        }

        inline void IRAM_ATTR gpio_fast_write_low(int8_t pin) noexcept
        {
#if PIPCORE_TARGET_ESP32
            if (__builtin_expect(pin < 32, 1))
            {
                GPIO.out_w1tc = (1UL << pin);
            }
            else
            {
                gpio_ll_set_level(&GPIO, static_cast<gpio_num_t>(pin), 0);
            }
#else
            (void)pin;
#endif
        }

        void IRAM_ATTR lcd_spi_pre_cb(spi_transaction_t *t)
        {
#if PIPCORE_TARGET_ESP32
            const uint32_t packed = static_cast<uint32_t>(reinterpret_cast<uintptr_t>(t->user));
            const int8_t pin = static_cast<int8_t>(packed >> 8);
            const uint8_t level = static_cast<uint8_t>(packed);

            if (pin >= 0)
            {
                if (level)
                {
                    if (__builtin_expect(pin < 32, 1))
                    {
                        GPIO.out_w1ts = (1UL << pin);
                    }
                    else
                    {
                        gpio_ll_set_level(&GPIO, static_cast<gpio_num_t>(pin), 1);
                    }
                }
                else
                {
                    if (__builtin_expect(pin < 32, 1))
                    {
                        GPIO.out_w1tc = (1UL << pin);
                    }
                    else
                    {
                        gpio_ll_set_level(&GPIO, static_cast<gpio_num_t>(pin), 0);
                    }
                }
            }
#else
            (void)t;
#endif
        }

        [[nodiscard]] inline void *packDcInfo(int8_t pin, uint8_t level) noexcept
        {
            const uint32_t packed = (static_cast<uint32_t>(static_cast<uint8_t>(pin)) << 8) | level;
            return reinterpret_cast<void *>(static_cast<uintptr_t>(packed));
        }

        [[nodiscard]] constexpr int8_t resolveDefaultMosi() noexcept
        {
#if defined(CONFIG_IDF_TARGET_ESP32)
            return 13;
#elif defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)
            return 11;
#elif defined(CONFIG_IDF_TARGET_ESP32C2) || defined(CONFIG_IDF_TARGET_ESP32C3) || \
    defined(CONFIG_IDF_TARGET_ESP32C6) || defined(CONFIG_IDF_TARGET_ESP32H2)
            return 7;
#else
            return -1;
#endif
        }

        [[nodiscard]] constexpr int8_t resolveDefaultSclk() noexcept
        {
#if defined(CONFIG_IDF_TARGET_ESP32)
            return 14;
#elif defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)
            return 12;
#elif defined(CONFIG_IDF_TARGET_ESP32C2) || defined(CONFIG_IDF_TARGET_ESP32C3) || \
    defined(CONFIG_IDF_TARGET_ESP32C6) || defined(CONFIG_IDF_TARGET_ESP32H2)
            return 6;
#else
            return -1;
#endif
        }

        [[nodiscard]] constexpr int8_t resolveDefaultCs() noexcept
        {
#if defined(CONFIG_IDF_TARGET_ESP32)
            return 15;
#elif defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3) || \
    defined(CONFIG_IDF_TARGET_ESP32C2) || defined(CONFIG_IDF_TARGET_ESP32C3) ||   \
    defined(CONFIG_IDF_TARGET_ESP32C6) || defined(CONFIG_IDF_TARGET_ESP32H2)
            return 10;
#else
            return -1;
#endif
        }
    }

    void St7789Spi::configure(int8_t mosi, int8_t sclk, int8_t cs, int8_t dc, int8_t rst, uint32_t hz) noexcept
    {
        deinit();

        _pinMosi = isPinValid(mosi) ? mosi : resolveDefaultMosi();
        _pinSclk = isPinValid(sclk) ? sclk : resolveDefaultSclk();
        _pinCs = isPinValid(cs) ? cs : resolveDefaultCs();

        _pinDc = dc;
        _pinRst = rst;
        _hz = hz ? hz : 80000000U;

