pisppus/PipKit/lib/PipKit/PipCore/Platforms/ESP32/Transports/St7789Spi.cpp
            while (remaining > 0)
            {
                while (_asyncInFlight >= MaxDmaBufs)
                {
                    if (__builtin_expect(!waitOldest(), 0))
                        return false;
                }

                const size_t chunk = std::min(remaining, DmaBufferBytes);
                std::memcpy(_dmaBuf[_asyncNext], p, chunk);

                spi_transaction_t *t = &_asyncTrans[_asyncNext];
                t->flags = (remaining > chunk && hasCs) ? SPI_TRANS_CS_KEEP_ACTIVE : 0;
                t->length = static_cast<int>(chunk << 3);
                t->rxlength = 0;
                t->tx_buffer = _dmaBuf[_asyncNext];

                esp_err_t err = spi_device_queue_trans(static_cast<spi_device_handle_t>(_spiHandle), t, portMAX_DELAY);
                if (__builtin_expect(err != ESP_OK, 0))
                    return fail(st7789::IoError::QueueTransmit);

                _asyncNext ^= 1;
                _asyncInFlight++;

                p += chunk;
                remaining -= chunk;
            }
            return true;
        }
    }

    bool IRAM_ATTR St7789Spi::fillPixels(uint16_t color, size_t count)
    {
        if (__builtin_expect(!_spiHandle || !_dmaBuf[0] || !_dmaBuf[1], 0))
            return fail(st7789::IoError::NotReady);

        if (__builtin_expect(!acquireBus(), 0))
            return false;

        constexpr size_t bufSizePixels = DmaBufferBytes / sizeof(uint16_t);

        if (__builtin_expect(count <= bufSizePixels, 1))
        {
            uint16_t *buf = reinterpret_cast<uint16_t *>(_dmaBuf[_asyncNext]);
            const uint32_t color32 = (static_cast<uint32_t>(color) << 16) | color;

            fastFill32(reinterpret_cast<uint32_t *>(buf), count >> 1, color32);
            if (count & 1U)
            {
                buf[count - 1] = color;
            }

            while (_asyncInFlight >= MaxDmaBufs)
            {
                if (__builtin_expect(!waitOldest(), 0))
                    return false;
            }

            spi_transaction_t *t = &_asyncTrans[_asyncNext];
            t->flags = 0;
            t->length = static_cast<int>(count << 4);
            t->rxlength = 0;
            t->tx_buffer = _dmaBuf[_asyncNext];

            const esp_err_t err = spi_device_queue_trans(static_cast<spi_device_handle_t>(_spiHandle), t, portMAX_DELAY);
            if (__builtin_expect(err != ESP_OK, 0))
            {
                return fail(st7789::IoError::QueueTransmit);
            }

            _asyncNext ^= 1;
            _asyncInFlight++;
            return true;
        }

        uint16_t *buf0 = reinterpret_cast<uint16_t *>(_dmaBuf[0]);
        uint16_t *buf1 = reinterpret_cast<uint16_t *>(_dmaBuf[1]);

        const uint32_t color32 = (static_cast<uint32_t>(color) << 16) | color;

        fastFill32(reinterpret_cast<uint32_t *>(buf0), bufSizePixels >> 1, color32);
        fastFill32(reinterpret_cast<uint32_t *>(buf1), bufSizePixels >> 1, color32);

        const bool hasCs = (_pinCs >= 0);
        size_t remaining = count;

        while (remaining)
        {
            while (_asyncInFlight >= MaxDmaBufs)
            {
                if (__builtin_expect(!waitOldest(), 0))
                    return false;
            }

            const size_t n = std::min(remaining, bufSizePixels);
            spi_transaction_t *t = &_asyncTrans[_asyncNext];

            t->flags = (remaining > n && hasCs) ? SPI_TRANS_CS_KEEP_ACTIVE : 0;
            t->length = static_cast<int>(n << 4);
            t->rxlength = 0;
            t->tx_buffer = _dmaBuf[_asyncNext];

            const esp_err_t err = spi_device_queue_trans(static_cast<spi_device_handle_t>(_spiHandle), t, portMAX_DELAY);
            if (__builtin_expect(err != ESP_OK, 0))
            {
                return fail(st7789::IoError::QueueTransmit);
            }

            _asyncNext ^= 1;
            _asyncInFlight++;

            remaining -= n;
        }

        return true;
    }

    bool IRAM_ATTR St7789Spi::waitComplete()
    {
        bool success = drainQueue();
        releaseBus();
        return success;
    }
}

#endif